Autodesk.Revit.DB.Structure.RebarSplice.CreateSpliceInfo(Autodesk.Revit.DB.ElementId,System.Boolean,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Structure.RebarSplicePosition)
Creates a new instance of SpliceInfo object.
connectedRebarId:
The connected Rebar id.
spliceDirectionParallelToDistributionPath:
Specifies if the splice direction between 2 bars is parallel or antiparallel with the bar distribution path.
spliceTypeId:
Specifies the splice type id that drives this splice Information.
Returns:
The newly created SpliceInfo.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2025

Autodesk.Revit.DB.Structure.RebarSplice.RotateRebarSpliceGeometry(Autodesk.Revit.DB.Line,System.Double)
Rotates the RebarSpliceGeometry about the given axis and angle.
axis:
The axis of rotation.
angle:
The angle of the rotation in radians.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for angle is not finite
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Structure.RebarSplice.MoveRebarSpliceGeometry(Autodesk.Revit.DB.XYZ)
Moves the RebarSpliceGeometry with the specified vector.
translation:
The translation vector that will be applied.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Structure.RebarSplice.GetRebarSpliceGeometry
Gets the RebarSpliceGeometry.
Returns:
Returns the RebarSpliceGeometry.
Since:
2025

Autodesk.Revit.DB.Structure.RebarSplice.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.RebarSplice.SplicePosition
Identifies the splice position.
Remarks:
This property describes the position of the splice face with respect to each bar end involved in splice.
Middle describes the behavior when both bar ends extends with half of the lap length and the splice plane sits between them.
End1 and End2 describes the behavior when one of the bar ends is on the splice plane and the other bar end extends with the lap length.
End1 means that the lap is computed towards the start of the splice chain, while End2 means that the lap is computed towards the end of the splice chain.
For more information about the splice chain concept please check Autodesk.Revit.DB.Structure.RebarSpliceUtils.GetSpliceChain(Rebar rebar).
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2025

Autodesk.Revit.DB.Structure.RebarSplice.SpliceTypeId
Identifies the id of the Rebar Splice Type.
Remarks:
Interactions with Rebar Splice Types can be done with the functions in Autodesk.Revit.DB.Structure.RebarSpliceTypeUtils.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The provided id doesn't represent a valid Rebar Splice Type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Structure.RebarSplice.ConnectedRebarEnd
Identifies the end of the connected rebar which is part of this splice - 0 for start, 1 for end.
Since:
2025

Autodesk.Revit.DB.Structure.RebarSplice.SourceRebarEnd
Identifies the end of the source rebar which is part of this rebar splice - 0 for start, 1 for end.
The source rebar is the one from which this rebar splice was obtained.
Since:
2025

Autodesk.Revit.DB.Structure.RebarSplice.SourceRebarId
Identifies the source of the target rebar which is part of this rebar splice.
The source rebar is the one from which this rebar splice was obtained.
Since:
2025

Autodesk.Revit.DB.Structure.RebarSplice.SpliceDirParallelToDistribPath
True if splice direction is parallel to distribution path, false if antiparallel.
Since:
2025

Autodesk.Revit.DB.Structure.RebarSplice.ConnectedRebarId
Identifies the connected rebar id of this rebar splice object.
Since:
2025

Autodesk.Revit.DB.Structure.RebarSplice
A class that can used to access the data between two connected Rebars.
Since:
2025